aliyfia/AliyfiaBoard_IOAI/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################

##############################################################
# Custom Board: ESP32S3_IOAI
##############################################################

aliyfiaboard_ioai.name=ESP32S3_IOAI

aliyfiaboard_ioai.bootloader.tool=esptool_py
aliyfiaboard_ioai.bootloader.tool.default=esptool_py

aliyfiaboard_ioai.upload.tool=esptool_py
aliyfiaboard_ioai.upload.tool.default=esptool_py
aliyfiaboard_ioai.upload.tool.network=esp_ota

aliyfiaboard_ioai.upload.maximum_size=16777216  # Updated for maximum size
aliyfiaboard_ioai.upload.maximum_data_size=327680
aliyfiaboard_ioai.upload.flags=
aliyfiaboard_ioai.upload.extra_flags=
aliyfiaboard_ioai.upload.use_1200bps_touch=false
aliyfiaboard_ioai.upload.wait_for_upload_port=false

aliyfiaboard_ioai.serial.disableDTR=false
aliyfiaboard_ioai.serial.disableRTS=false

aliyfiaboard_ioai.build.tarch=xtensa
aliyfiaboard_ioai.build.bootloader_addr=0x0
aliyfiaboard_ioai.build.target=esp32s3
aliyfiaboard_ioai.build.mcu=esp32s3
aliyfiaboard_ioai.build.core=esp32
aliyfiaboard_ioai.build.variant=esp32s3
aliyfiaboard_ioai.build.board=ALIYFIABOARD_IOAI

aliyfiaboard_ioai.build.usb_mode=1
aliyfiaboard_ioai.build.cdc_on_boot=0
aliyfiaboard_ioai.build.msc_on_boot=0
aliyfiaboard_ioai.build.dfu_on_boot=0
aliyfiaboard_ioai.build.f_cpu=240000000L
aliyfiaboard_ioai.build.flash_size=4MB
aliyfiaboard_ioai.build.flash_freq=80m
aliyfiaboard_ioai.build.flash_mode=dio
aliyfiaboard_ioai.build.boot=qio
aliyfiaboard_ioai.build.boot_freq=80m
aliyfiaboard_ioai.build.partitions=default
aliyfiaboard_ioai.build.defines=
aliyfiaboard_ioai.build.loop_core=
aliyfiaboard_ioai.build.event_core=
aliyfiaboard_ioai.build.psram_type=qspi
aliyfiaboard_ioai.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
aliyfiaboard_ioai.menu.JTAGAdapter.default=Disabled
aliyfiaboard_ioai.menu.JTAGAdapter.default.build.copy_jtag_files=0
aliyfiaboard_ioai.menu.JTAGAdapter.builtin=Integrated USB JTAG
aliyfiaboard_ioai.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
aliyfiaboard_ioai.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
aliyfiaboard_ioai.menu.JTAGAdapter.external=FTDI Adapter
aliyfiaboard_ioai.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
aliyfiaboard_ioai.menu.JTAGAdapter.external.build.copy_jtag_files=1
aliyfiaboard_ioai.menu.JTAGAdapter.bridge=ESP USB Bridge
aliyfiaboard_ioai.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
aliyfiaboard_ioai.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

aliyfiaboard_ioai.menu.PSRAM.disabled=Disabled
aliyfiaboard_ioai.menu.PSRAM.disabled.build.defines=
aliyfiaboard_ioai.menu.PSRAM.disabled.build.psram_type=qspi
aliyfiaboard_ioai.menu.PSRAM.enabled=QSPI PSRAM
aliyfiaboard_ioai.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
aliyfiaboard_ioai.menu.PSRAM.enabled.build.psram_type=qspi
aliyfiaboard_ioai.menu.PSRAM.opi=OPI PSRAM
aliyfiaboard_ioai.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
aliyfiaboard_ioai.menu.PSRAM.opi.build.psram_type=opi

aliyfiaboard_ioai.menu.FlashMode.qio=QIO 80MHz
aliyfiaboard_ioai.menu.FlashMode.qio.build.flash_mode=dio
aliyfiaboard_ioai.menu.FlashMode.qio.build.boot=qio
aliyfiaboard_ioai.menu.FlashMode.qio.build.boot_freq=80m
aliyfiaboard_ioai.menu.FlashMode.qio120=QIO 120MHz
aliyfiaboard_ioai.menu.FlashMode.qio120.build.flash_mode=dio
aliyfiaboard_ioai.menu.FlashMode.qio120.build.boot=qio
aliyfiaboard_ioai.menu.FlashMode.qio120.build.boot_freq=120m
aliyfiaboard_ioai.menu.FlashMode.qio120.build.flash_freq=80m
aliyfiaboard_ioai.menu.FlashMode.dio=DIO 80MHz
aliyfiaboard_ioai.menu.FlashMode.dio.build.flash_mode=dio
aliyfiaboard_ioai.menu.FlashMode.dio.build.boot=dio
aliyfiaboard_ioai.menu.FlashMode.dio.build.boot_freq=80m
aliyfiaboard_ioai.menu.FlashMode.opi=OPI 80MHz
aliyfiaboard_ioai.menu.FlashMode.opi.build.flash_mode=dout
aliyfiaboard_ioai.menu.FlashMode.opi.build.boot=opi
aliyfiaboard_ioai.menu.FlashMode.opi.build.boot_freq=80m
aliyfiaboard_ioai.menu.FlashMode.opi.build.flash_freq=80m

aliyfiaboard_ioai.menu.FlashSize.4M=4MB (32Mb)
aliyfiaboard_ioai.menu.FlashSize.4M.build.flash_size=4MB
aliyfiaboard_ioai.menu.FlashSize.8M=8MB (64Mb)
aliyfiaboard_ioai.menu.FlashSize.8M.build.flash_size=8MB
aliyfiaboard_ioai.menu.FlashSize.8M.build.partitions=default_8MB
aliyfiaboard_ioai.menu.FlashSize.16M=16MB (128Mb)
aliyfiaboard_ioai.menu.FlashSize.16M.build.flash_size=16MB
aliyfiaboard_ioai.menu.FlashSize.32M=32MB (256Mb)
aliyfiaboard_ioai.menu.FlashSize.32M.build.flash_size=32MB
aliyfiaboard_ioai.menu.FlashSize.32M.build.partitions=app5M_fat24M_32MB

aliyfiaboard_ioai.menu.LoopCore.1=Core 1
aliyfiaboard_ioai.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
aliyfiaboard_ioai.menu.LoopCore.0=Core 0
aliyfiaboard_ioai.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

aliyfiaboard_ioai.menu.EventsCore.1=Core 1
aliyfiaboard_ioai.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
aliyfiaboard_ioai.menu.EventsCore.0=Core 0
aliyfiaboard_ioai.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

aliyfiaboard_ioai.menu.USBMode.hwcdc=Hardware CDC and JTAG
aliyfiaboard_ioai.menu.USBMode.hwcdc.build.usb_mode=1
aliyfiaboard_ioai.menu.USBMode.default=USB-OTG (TinyUSB)
aliyfiaboard_ioai.menu.USBMode.default.build.usb_mode=0

