aliyfia/AliyfiaBoard_IOAI/boards.txt
aliyfiaboard_ioai.menu.CDCOnBoot.default=Disabled
aliyfiaboard_ioai.menu.CDCOnBoot.default.build.cdc_on_boot=0
aliyfiaboard_ioai.menu.CDCOnBoot.cdc=Enabled
aliyfiaboard_ioai.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

aliyfiaboard_ioai.menu.MSCOnBoot.default=Disabled
aliyfiaboard_ioai.menu.MSCOnBoot.default.build.msc_on_boot=0
aliyfiaboard_ioai.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
aliyfiaboard_ioai.menu.MSCOnBoot.msc.build.msc_on_boot=1

aliyfiaboard_ioai.menu.DFUOnBoot.default=Disabled
aliyfiaboard_ioai.menu.DFUOnBoot.default.build.dfu_on_boot=0
aliyfiaboard_ioai.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
aliyfiaboard_ioai.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

aliyfiaboard_ioai.menu.UploadMode.default=UART0 / Hardware CDC
aliyfiaboard_ioai.menu.UploadMode.default.upload.use_1200bps_touch=false
aliyfiaboard_ioai.menu.UploadMode.default.upload.wait_for_upload_port=false
aliyfiaboard_ioai.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
aliyfiaboard_ioai.menu.UploadMode.cdc.upload.use_1200bps_touch=true
aliyfiaboard_ioai.menu.UploadMode.cdc.upload.wait_for_upload_port=true

##############################################################
# Custom Partition Schemes for AliyfiaBoard_IOAI
##############################################################

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_ffat=AliyfiaBoard_IOAI - Balanced 7MB APP, 7MB OTA, 2MB FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_ffat.build.partitions=Aliyfia_balanced_7MB_APP_7MB_OTA_2MB_FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_ffat.upload.maximum_size=7340032

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_spiffs=AliyfiaBoard_IOAI - Balanced 7MB APP, 7MB OTA, 2MB SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_spiffs.build.partitions=Aliyfia_balanced_7MB_APP_7MB_OTA_2MB_SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_balanced_spiffs.upload.maximum_size=7340032

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ffat=AliyfiaBoard_IOAI - Max 5MB APP, 5MB OTA, 6MB FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ffat.build.partitions=Aliyfia_max_ffat_5MB_APP_5MB_OTA_6MB_FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ffat.upload.maximum_size=5242880

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_ffat=AliyfiaBoard_IOAI - Max OTA 6MB APP, 6MB OTA, 4MB FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_ffat.build.partitions=Aliyfia_max_ota_6MB_APP_6MB_OTA_4MB_FFat
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_ffat.upload.maximum_size=6291456

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_spiffs=AliyfiaBoard_IOAI - Max OTA 6MB APP, 6MB OTA, 4MB SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_spiffs.build.partitions=Aliyfia_max_ota_6MB_APP_6MB_OTA_4MB_SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_ota_spiffs.upload.maximum_size=6291456

aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_spiffs=AliyfiaBoard_IOAI - Max SPIFFS 5MB APP, 5MB OTA, 6MB SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_spiffs.build.partitions=Aliyfia_max_spiffs_5MB_APP_5MB_OTA_6MB_SPIFFS
aliyfiaboard_ioai.menu.PartitionScheme.AliyfiaBoard_max_spiffs.upload.maximum_size=5242880

##############################################################

aliyfiaboard_ioai.menu.CPUFreq.240=240MHz (WiFi)
aliyfiaboard_ioai.menu.CPUFreq.240.build.f_cpu=240000000L
aliyfiaboard_ioai.menu.CPUFreq.160=160MHz (WiFi)
aliyfiaboard_ioai.menu.CPUFreq.160.build.f_cpu=160000000L
aliyfiaboard_ioai.menu.CPUFreq.80=80MHz (WiFi)
aliyfiaboard_ioai.menu.CPUFreq.80.build.f_cpu=80000000L
aliyfiaboard_ioai.menu.CPUFreq.40=40MHz
aliyfiaboard_ioai.menu.CPUFreq.40.build.f_cpu=40000000L
aliyfiaboard_ioai.menu.CPUFreq.20=20MHz
aliyfiaboard_ioai.menu.CPUFreq.20.build.f_cpu=20000000L
aliyfiaboard_ioai.menu.CPUFreq.10=10MHz
aliyfiaboard_ioai.menu.CPUFreq.10.build.f_cpu=10000000L

aliyfiaboard_ioai.menu.UploadSpeed.921600=921600
aliyfiaboard_ioai.menu.UploadSpeed.921600.upload.speed=921600
aliyfiaboard_ioai.menu.UploadSpeed.115200=115200
aliyfiaboard_ioai.menu.UploadSpeed.115200.upload.speed=115200
aliyfiaboard_ioai.menu.UploadSpeed.256000.windows=256000
aliyfiaboard_ioai.menu.UploadSpeed.256000.upload.speed=256000
aliyfiaboard_ioai.menu.UploadSpeed.230400.windows.upload.speed=256000
aliyfiaboard_ioai.menu.UploadSpeed.230400=230400
aliyfiaboard_ioai.menu.UploadSpeed.230400.upload.speed=230400
aliyfiaboard_ioai.menu.UploadSpeed.460800.linux=460800
aliyfiaboard_ioai.menu.UploadSpeed.460800.macosx=460800
aliyfiaboard_ioai.menu.UploadSpeed.460800.upload.speed=460800
aliyfiaboard_ioai.menu.UploadSpeed.512000.windows=512000
aliyfiaboard_ioai.menu.UploadSpeed.512000.upload.speed=512000

aliyfiaboard_ioai.menu.DebugLevel.none=None
aliyfiaboard_ioai.menu.DebugLevel.none.build.code_debug=0
aliyfiaboard_ioai.menu.DebugLevel.error=Error
aliyfiaboard_ioai.menu.DebugLevel.error.build.code_debug=1
aliyfiaboard_ioai.menu.DebugLevel.warn=Warn
aliyfiaboard_ioai.menu.DebugLevel.warn.build.code_debug=2
aliyfiaboard_ioai.menu.DebugLevel.info=Info
aliyfiaboard_ioai.menu.DebugLevel.info.build.code_debug=3
aliyfiaboard_ioai.menu.DebugLevel.debug=Debug
aliyfiaboard_ioai.menu.DebugLevel.debug.build.code_debug=4
aliyfiaboard_ioai.menu.DebugLevel.verbose=Verbose
aliyfiaboard_ioai.menu.DebugLevel.verbose.build.code_debug=5

aliyfiaboard_ioai.menu.EraseFlash.none=Disabled
aliyfiaboard_ioai.menu.EraseFlash.none.upload.erase_cmd=
aliyfiaboard_ioai.menu.EraseFlash.all=Enabled
aliyfiaboard_ioai.menu.EraseFlash.all.upload.erase_cmd=-e

aliyfiaboard_ioai.menu.ZigbeeMode.default=Disabled
aliyfiaboard_ioai.menu.ZigbeeMode.default.build.zigbee_mode=
aliyfiaboard_ioai.menu.ZigbeeMode.default.build.zigbee_libs=
aliyfiaboard_ioai.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
aliyfiaboard_ioai.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
aliyfiaboard_ioai.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

aliyfiaboard_ioai.menu.PinNumbers.default=Disabled
aliyfiaboard_ioai.menu.PinNumbers.default.build.pin_numbering=
aliyfiaboard_ioai.menu.PinNumbers.io=IO Pin Numbers
aliyfiaboard_ioai.menu.PinNumbers.io.build.pin_numbering=-DESP32_IO_PIN_NUMBERS

