aliyfia/AliyfiaBoard_IOAI/boards.txt
esp32c6.menu.CPUFreq.160=160MHz (WiFi)
esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
esp32c6.menu.CPUFreq.120=120MHz (WiFi)
esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
esp32c6.menu.CPUFreq.80=80MHz (WiFi)
esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
esp32c6.menu.CPUFreq.40=40MHz
esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
esp32c6.menu.CPUFreq.20=20MHz
esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
esp32c6.menu.CPUFreq.10=10MHz
esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

esp32c6.menu.FlashMode.qio=QIO
esp32c6.menu.FlashMode.qio.build.flash_mode=dio
esp32c6.menu.FlashMode.qio.build.boot=qio
esp32c6.menu.FlashMode.dio=DIO
esp32c6.menu.FlashMode.dio.build.flash_mode=dio
esp32c6.menu.FlashMode.dio.build.boot=dio

esp32c6.menu.FlashFreq.80=80MHz
esp32c6.menu.FlashFreq.80.build.flash_freq=80m
esp32c6.menu.FlashFreq.40=40MHz
esp32c6.menu.FlashFreq.40.build.flash_freq=40m

esp32c6.menu.FlashSize.4M=4MB (32Mb)
esp32c6.menu.FlashSize.4M.build.flash_size=4MB
esp32c6.menu.FlashSize.8M=8MB (64Mb)
esp32c6.menu.FlashSize.8M.build.flash_size=8MB
esp32c6.menu.FlashSize.8M.build.partitions=default_8MB
esp32c6.menu.FlashSize.2M=2MB (16Mb)
esp32c6.menu.FlashSize.2M.build.flash_size=2MB
esp32c6.menu.FlashSize.2M.build.partitions=minimal
esp32c6.menu.FlashSize.16M=16MB (128Mb)
esp32c6.menu.FlashSize.16M.build.flash_size=16MB

esp32c6.menu.UploadSpeed.921600=921600
esp32c6.menu.UploadSpeed.921600.upload.speed=921600
esp32c6.menu.UploadSpeed.115200=115200
esp32c6.menu.UploadSpeed.115200.upload.speed=115200
esp32c6.menu.UploadSpeed.256000.windows=256000
esp32c6.menu.UploadSpeed.256000.upload.speed=256000
esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32c6.menu.UploadSpeed.230400=230400
esp32c6.menu.UploadSpeed.230400.upload.speed=230400
esp32c6.menu.UploadSpeed.460800.linux=460800
esp32c6.menu.UploadSpeed.460800.macosx=460800
esp32c6.menu.UploadSpeed.460800.upload.speed=460800
esp32c6.menu.UploadSpeed.512000.windows=512000
esp32c6.menu.UploadSpeed.512000.upload.speed=512000

esp32c6.menu.DebugLevel.none=None
esp32c6.menu.DebugLevel.none.build.code_debug=0
esp32c6.menu.DebugLevel.error=Error
esp32c6.menu.DebugLevel.error.build.code_debug=1
esp32c6.menu.DebugLevel.warn=Warn
esp32c6.menu.DebugLevel.warn.build.code_debug=2
esp32c6.menu.DebugLevel.info=Info
esp32c6.menu.DebugLevel.info.build.code_debug=3
esp32c6.menu.DebugLevel.debug=Debug
esp32c6.menu.DebugLevel.debug.build.code_debug=4
esp32c6.menu.DebugLevel.verbose=Verbose
esp32c6.menu.DebugLevel.verbose.build.code_debug=5

esp32c6.menu.EraseFlash.none=Disabled
esp32c6.menu.EraseFlash.none.upload.erase_cmd=
esp32c6.menu.EraseFlash.all=Enabled
esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

esp32c6.menu.ZigbeeMode.default=Disabled
esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api_ed -lesp_zb_cli_command -lzboss_stack.ed -lzboss_port
esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port
esp32c6.menu.ZigbeeMode.rcp=Zigbee RCP (radio co-processor)
esp32c6.menu.ZigbeeMode.rcp.build.zigbee_mode=-DZIGBEE_MODE_RCP
esp32c6.menu.ZigbeeMode.rcp.build.zigbee_libs=-lesp_zb_api_rcp -lesp_zb_cli_command -lzboss_stack.rcp -lzboss_port

##############################################################

esp32s3.name=ESP32S3 Dev Module

esp32s3.bootloader.tool=esptool_py
esp32s3.bootloader.tool.default=esptool_py

esp32s3.upload.tool=esptool_py
esp32s3.upload.tool.default=esptool_py
esp32s3.upload.tool.network=esp_ota

esp32s3.upload.maximum_size=1310720
esp32s3.upload.maximum_data_size=327680
esp32s3.upload.flags=
esp32s3.upload.extra_flags=
esp32s3.upload.use_1200bps_touch=false
esp32s3.upload.wait_for_upload_port=false

esp32s3.serial.disableDTR=false
esp32s3.serial.disableRTS=false

esp32s3.build.tarch=xtensa
esp32s3.build.bootloader_addr=0x0
esp32s3.build.target=esp32s3
esp32s3.build.mcu=esp32s3
esp32s3.build.core=esp32
esp32s3.build.variant=esp32s3
esp32s3.build.board=ESP32S3_DEV

esp32s3.build.usb_mode=1
esp32s3.build.cdc_on_boot=0
esp32s3.build.msc_on_boot=0
esp32s3.build.dfu_on_boot=0
esp32s3.build.f_cpu=240000000L
esp32s3.build.flash_size=4MB
esp32s3.build.flash_freq=80m
esp32s3.build.flash_mode=dio
esp32s3.build.boot=qio
esp32s3.build.boot_freq=80m
esp32s3.build.partitions=default
esp32s3.build.defines=
esp32s3.build.loop_core=
esp32s3.build.event_core=
esp32s3.build.psram_type=qspi
esp32s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
esp32s3.menu.JTAGAdapter.default=Disabled
esp32s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
esp32s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32s3.menu.JTAGAdapter.external=FTDI Adapter
esp32s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
esp32s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s3.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
esp32s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s3.menu.PSRAM.disabled=Disabled
esp32s3.menu.PSRAM.disabled.build.defines=
esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3.menu.PSRAM.enabled=QSPI PSRAM
esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3.menu.PSRAM.opi=OPI PSRAM
esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.opi.build.psram_type=opi

esp32s3.menu.FlashMode.qio=QIO 80MHz
esp32s3.menu.FlashMode.qio.build.flash_mode=dio
esp32s3.menu.FlashMode.qio.build.boot=qio
esp32s3.menu.FlashMode.qio.build.boot_freq=80m
esp32s3.menu.FlashMode.qio.build.flash_freq=80m
esp32s3.menu.FlashMode.qio120=QIO 120MHz
esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3.menu.FlashMode.qio120.build.boot=qio
esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3.menu.FlashMode.dio=DIO 80MHz
esp32s3.menu.FlashMode.dio.build.flash_mode=dio
esp32s3.menu.FlashMode.dio.build.boot=dio
esp32s3.menu.FlashMode.dio.build.boot_freq=80m
esp32s3.menu.FlashMode.dio.build.flash_freq=80m
esp32s3.menu.FlashMode.opi=OPI 80MHz
esp32s3.menu.FlashMode.opi.build.flash_mode=dout
esp32s3.menu.FlashMode.opi.build.boot=opi
esp32s3.menu.FlashMode.opi.build.boot_freq=80m
esp32s3.menu.FlashMode.opi.build.flash_freq=80m

