aliyfia/AliyfiaBoard_IOAI/boards.txt
esp32da.menu.FlashSize.4M=4MB (32Mb)
esp32da.menu.FlashSize.4M.build.flash_size=4MB
esp32da.menu.FlashSize.8M=8MB (64Mb)
esp32da.menu.FlashSize.8M.build.flash_size=8MB
esp32da.menu.FlashSize.8M.build.partitions=default_8MB
esp32da.menu.FlashSize.16M=16MB (128Mb)
esp32da.menu.FlashSize.16M.build.flash_size=16MB

esp32da.menu.UploadSpeed.921600=921600
esp32da.menu.UploadSpeed.921600.upload.speed=921600
esp32da.menu.UploadSpeed.115200=115200
esp32da.menu.UploadSpeed.115200.upload.speed=115200
esp32da.menu.UploadSpeed.256000.windows=256000
esp32da.menu.UploadSpeed.256000.upload.speed=256000
esp32da.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32da.menu.UploadSpeed.230400=230400
esp32da.menu.UploadSpeed.230400.upload.speed=230400
esp32da.menu.UploadSpeed.460800.linux=460800
esp32da.menu.UploadSpeed.460800.macosx=460800
esp32da.menu.UploadSpeed.460800.upload.speed=460800
esp32da.menu.UploadSpeed.512000.windows=512000
esp32da.menu.UploadSpeed.512000.upload.speed=512000

esp32da.menu.LoopCore.1=Core 1
esp32da.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32da.menu.LoopCore.0=Core 0
esp32da.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32da.menu.EventsCore.1=Core 1
esp32da.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32da.menu.EventsCore.0=Core 0
esp32da.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32da.menu.DebugLevel.none=None
esp32da.menu.DebugLevel.none.build.code_debug=0
esp32da.menu.DebugLevel.error=Error
esp32da.menu.DebugLevel.error.build.code_debug=1
esp32da.menu.DebugLevel.warn=Warn
esp32da.menu.DebugLevel.warn.build.code_debug=2
esp32da.menu.DebugLevel.info=Info
esp32da.menu.DebugLevel.info.build.code_debug=3
esp32da.menu.DebugLevel.debug=Debug
esp32da.menu.DebugLevel.debug.build.code_debug=4
esp32da.menu.DebugLevel.verbose=Verbose
esp32da.menu.DebugLevel.verbose.build.code_debug=5

esp32da.menu.EraseFlash.none=Disabled
esp32da.menu.EraseFlash.none.upload.erase_cmd=
esp32da.menu.EraseFlash.all=Enabled
esp32da.menu.EraseFlash.all.upload.erase_cmd=-e

